# <span style="color:darkblue"> Lecture 16 - Practicing Chaining </span>

<font size = "5">

In this lecture you will get a chance to practice <br>
the main dataset operations

- There will be a quiz on this lecture

# <span style="color:darkblue"> I. Import Libraries and Data </span>

In [1]:
import numpy as np
import pandas as pd

In [2]:
results  = pd.read_csv("data_raw/results.csv")
races    = pd.read_csv("data_raw/races.csv")
results["points col"] = results["points"]

# <span style="color:darkblue"> II. Review Dataset Operations </span>

<font size = "5">

See attached file for a refresher on syntax

```[] ``` $\qquad \qquad \qquad \quad$: Extracting columns <br>
```.query() ``` $\qquad \qquad $: Subsetting rows <br>
```.recode() ``` $ \qquad \quad \ \ $: Replacing values <br>
```.groupby().agg() ```: Aggregate statistics by subgroup <br>
```.rename() ``` $\qquad \quad \ \ $: Change name of columns

Full list:

<font size = "4">

https://www.w3schools.com/python/pandas/pandas_ref_dataframe.asp

# <span style="color:darkblue"> III. Examples of Chaining </span>

<font size = "5">

The operations with "." are read left to right

- Combine any of the above operations
- Great way to make code efficient
- The sky's the limit!


Subsetting **before** extracting columns

In [3]:
# Get data for drivers that scored more than 20 points on individual races
# Then extract the columns "driverId" and "points"
results.query('points >= 20')[["driverId","points"]]

       driverId  points
20320         4    25.0
20344        18    25.0
20368        20    25.0
20392        18    25.0
20416        17    25.0
...         ...     ...
25740       830    25.0
25760       830    25.0
25780       830    25.0
25800       847    26.0
25820       830    25.0

[262 rows x 2 columns]

<font size = "5">

Subsetting **before** aggregating

In [4]:
# This obtains a subset of drivers who competed in races 500 onwards
# then computes the average by team ("constructorId")

(results.query('raceId >= 500')
        .groupby("constructorId")
        .agg(mean_points = ("points","mean")))

               mean_points
constructorId
1                 3.148148
3                 1.904924
4                 1.903226
5                 1.203911
6                 4.910966
...                    ...
209               0.012821
210               0.809028
211               3.723684
213               2.327869
214               3.693182

[176 rows x 1 columns]

<font size = "5">

Subsetting **after** aggregating

In [5]:
# This obtains the average points by team ("constructorId"), then 
# produces a subset of team whose average is higher than 10

(results.groupby("constructorId")
        .agg(mean_points = ("points","mean"))
        .query('mean_points >= 10'))

               mean_points
constructorId
131              12.363643

<font size = "5">

Chaining inside queries + NaNs

In [6]:
# "is.na()" produces a True/False vector, checking for missing values
# "is.notna()" produces a True/False vector, checking for non-missing values
# .str.isnumeric() is used for checking whether individual rows of a
# string column are numeric.
results["points"].isna()
results["points"].notna()

subset_nas    = results.query('points.isna()')
subset_nonnas = results.query('points.notna()')

## <span style="color:darkblue"> III. Quiz Structure </span>

<font size = "5">

The day of the quiz I will ...
- Provide a dataset with information
- Give more specific instructions.
- Below, you will see the type of questions that will be asked.
- The idea is for you to apply known concepts to new data
- You have 50 minutes to complete the assignment

Questions

(exact wording may change in quiz, but exercise will be very similar)


<font size = "5">

(a) Replace the values of a column

- Obtain unique string values of a column
- Use the ".replace()" command

Hint: See Lecture 13

In [9]:
data = {'A': ['apple', 'banana', 'apple', 'orange', 'banana', 'apple']}
df = pd.DataFrame(data)
unique_values = df['A'].unique()
print(unique_values)
['apple', 'banana', 'orange']
replacement_values = {
    'apple': '1',
    'banana': 'fruit2',
    'orange': 'fruit3'
}
df['A'] = df['A'].replace(replacement_values)
print(df)

['apple' 'banana' 'orange']
        A
0       1
1  fruit2
2       1
3  fruit3
4  fruit2
5       1

<font size = "5">

(b) Recode a numeric column

- Use the "pd.cut()" command to create <br>
a new column based on an interval.
- See Lecture 14 for more details

In [11]:
import pandas as pd

# create a sample dataframe
data = {'name': ['John', 'Paul', 'George', 'Ringo'],
        'age': [20, 21, 19, 18],
        'city': ['New York', 'London', 'Los Angeles', 'Paris']}

df = pd.DataFrame(data)

# create a new column based on an interval
df['age_group'] = pd.cut(df['age'], bins=[0, 18, 21, 100], labels=['child', 'young adult', 'adult'])

print(df)

     name  age         city    age_group
0    John   20     New York  young adult
1    Paul   21       London  young adult
2  George   19  Los Angeles  young adult
3   Ringo   18        Paris        child

In [ ]:
students=pd.read_csv("data_raw/students.csv")
bins_grades = [0,54,59,64,69,74,79,82,86, 92,100]
labels_grades = ['F', 'D', 'C-','C','C+','B-','B','B+',"A-", "A"]

students["lettergrade"] = pd.cut(students["numericgrade"],
                                bins = bins_grades,
                                right = True,
                                labels = labels_grades)

<font size = "5">

(c) Aggregate and query

- Use a combniation of the following commands <br>
to produce a new dataset <br>
``` .query() ``` <br>
``` .groupby().agg() ``` <br>

In [2]:
results_agg = (results.query('raceId >= 200')
               .groupby(["constructorId"])
               .agg(mean_laps=('laps', 'mean'), 
                    std_laps=('laps', 'std')))
print(results_agg)

NameError: name 'results' is not defined

<font size = "5">

(d) Aggregate and sort

- Use a combniation of the following commands <br>
to produce a new dataset <br>
``` .groupby().agg() ``` <br>
``` .sort_values() ```

In [1]:
results_agg = (results.groupby('constructorId')
               .agg(mean_laps=('laps', 'mean'), 
                    std_laps=('laps', 'std'))
               .sort_values(by='mean_laps', ascending=False))
print(results_agg)

NameError: name 'results' is not defined

<font size = "5">

(e) Rename column

- Create a dictionary
- Rename one or more columns in a dataset <br>
using the dictionary

In [ ]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35],
    'gender': ['F', 'M', 'M']
})

# create a dictionary with old column names as keys and new column names as values
column_rename_dict = {
    'name': 'full_name',
    'age': 'years_old'
}

# use the rename() method of the dataframe to rename columns using the dictionary
df = df.rename(columns=column_rename_dict)

# print the updated dataframe
print(df)

<font size = "5">

(f) Merge dataset

- Use "pd.merge" to combine two datasets: <br>
a primary and secondary
- Only merge a subset of the columns of the <br>
secondary dataset
- Use "display" to show a the merged dataset,  <br>
extracting a subset of the columns

In [10]:
import pandas as pd

# create a sample primary dataframe
primary_df = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35]
})

# create a sample secondary dataframe
secondary_df = pd.DataFrame({
    'id': [1, 2, 3],
    'city': ['New York', 'London', 'Paris'],
    'country': ['USA', 'UK', 'France'],
    'job': ['Engineer', 'Manager', 'Doctor']
})

# merge the two dataframes based on the 'id' column
merged_df = pd.merge(primary_df, secondary_df, on='id')

# select a subset of the columns in the merged dataframe
subset_df = merged_df[['id', 'name', 'age', 'city']]

# display the subset of the columns in the merged dataframe
display(subset_df)

   id     name  age      city
0   1    Alice   25  New York
1   2      Bob   30    London
2   3  Charlie   35     Paris